---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.FlexDuct.EndTangent
source: html/bddac743-5c15-8854-3b05-f9a722f27fa6.htm
---
# Autodesk.Revit.DB.Mechanical.FlexDuct.EndTangent Property

Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent.

## Syntax (C#)
```csharp
public XYZ EndTangent { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null